---
kind: type
id: T:Autodesk.Revit.DB.Analysis.ValueAtPoint
source: html/00d82cae-806a-8145-5228-bb362c641790.htm
---
# Autodesk.Revit.DB.Analysis.ValueAtPoint

Stores values at one domain point.
 Each value corresponds to a "measurement" for which this value was calculated.

## Syntax (C#)
```csharp
public class ValueAtPoint : ValueAtPointBase
```